<a href="https://colab.research.google.com/github/t-abs/Apache-Spark/blob/main/Pyspark_12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

If Else Statement

In [1]:
from pyspark.sql import SparkSession

In [2]:
from pyspark.sql import SparkSession

# Create Spark session
spark = SparkSession.builder \
    .appName("Read CSV Example") \
    .getOrCreate()

In [3]:
emp_data = [
(1,'manish',26,20000,'india','IT'),
(2,'rahul',None,40000,'germany','engineering'),
(3,'pawan',12,60000,'india','sales'),
(4,'roshini',44,None,'uk','engineering'),
(5,'raushan',35,70000,'india','sales'),
(6,None,29,200000,'uk','IT'),
(7,'adam',37,65000,'us','IT'),
(8,'chris',16,40000,'us','sales'),
(None,None,None,None,None,None),
(7,'adam',37,65000,'us','IT')
]
emp_columns = ["emp_id","emp_name","emp_age","emp_salary","emp_country","emp_dept"]
df = spark.createDataFrame(data=emp_data, schema = emp_columns)
df

DataFrame[emp_id: bigint, emp_name: string, emp_age: bigint, emp_salary: bigint, emp_country: string, emp_dept: string]

In [6]:
from pyspark.sql.functions import col, when

df.withColumn("adult", when(col("emp_age") > 18, "Yes")
                        .when(col("emp_age") < 18, "No")
                         .otherwise("No Value")).show()

+------+--------+-------+----------+-----------+-----------+--------+
|emp_id|emp_name|emp_age|emp_salary|emp_country|   emp_dept|   adult|
+------+--------+-------+----------+-----------+-----------+--------+
|     1|  manish|     26|     20000|      india|         IT|     Yes|
|     2|   rahul|   NULL|     40000|    germany|engineering|No Value|
|     3|   pawan|     12|     60000|      india|      sales|      No|
|     4| roshini|     44|      NULL|         uk|engineering|     Yes|
|     5| raushan|     35|     70000|      india|      sales|     Yes|
|     6|    NULL|     29|    200000|         uk|         IT|     Yes|
|     7|    adam|     37|     65000|         us|         IT|     Yes|
|     8|   chris|     16|     40000|         us|      sales|      No|
|  NULL|    NULL|   NULL|      NULL|       NULL|       NULL|No Value|
|     7|    adam|     37|     65000|         us|         IT|     Yes|
+------+--------+-------+----------+-----------+-----------+--------+

In [7]:
df.createOrReplaceTempView("employee_data")

In [8]:
spark.sql("""
    SELECT
        emp_id,
        emp_name,
        emp_age,
        emp_salary,
        emp_country,
        emp_dept,
        CASE
            WHEN emp_age > 18 THEN 'Yes'
            WHEN emp_age < 18 THEN 'No'
            ELSE 'No Value'
        END AS adult
    FROM employee_data
""").show()

+------+--------+-------+----------+-----------+-----------+--------+
|emp_id|emp_name|emp_age|emp_salary|emp_country|   emp_dept|   adult|
+------+--------+-------+----------+-----------+-----------+--------+
|     1|  manish|     26|     20000|      india|         IT|     Yes|
|     2|   rahul|   NULL|     40000|    germany|engineering|No Value|
|     3|   pawan|     12|     60000|      india|      sales|      No|
|     4| roshini|     44|      NULL|         uk|engineering|     Yes|
|     5| raushan|     35|     70000|      india|      sales|     Yes|
|     6|    NULL|     29|    200000|         uk|         IT|     Yes|
|     7|    adam|     37|     65000|         us|         IT|     Yes|
|     8|   chris|     16|     40000|         us|      sales|      No|
|  NULL|    NULL|   NULL|      NULL|       NULL|       NULL|No Value|
|     7|    adam|     37|     65000|         us|         IT|     Yes|
+------+--------+-------+----------+-----------+-----------+--------+